# количество знаков в числе 2 в степени 100000
a = len(str(2 ** 100 )) 
print(a)

# импортируем модуль math и используем его
import math

a = math.pi
print(a)
print('<br>------------------------------------<br>')

b = math.sqrt(69)
print(b)
print('<br>------------------------------------<br>')


 # импортируем модуль random и используем его
import random

a = random.random()
print(a)
print('<br>------------------------------------<br>')

b = random.choice([1, 2, 3, 4, 5])
print(b)
print('<br>------------------------------------<br>')


# операции со строками
tmp = "this is a string"
a = len(tmp) # определяем количество символов в строке
print(a)
print('<br>------------------------------------<br>')

aStart = tmp[0] # индексация начинается с начала строки
print(aStart)
print('<br>------------------------------------<br>')

aEnd = tmp[-1] # индексация начинается с конца строки
print(aEnd)
print('<br>------------------------------------<br>')

a_four_first = tmp[:5] # выводим последовательность символов от 0 до 5 элемента
print(a_four_first)
print('<br>------------------------------------<br>')

a_four_end = tmp[12:] # выводим последовательность элементов, начиная с 5-го элемента и до последнего 
print(a_four_end)
print('<br>------------------------------------<br>')

a_from_fourth_to_twelfth = tmp[3:12] # последовательность с четвертого символа до 12-го
print(a_from_fourth_to_twelfth)
print('<br>------------------------------------<br>')

a_repeat = tmp * 3 # повторяем строковую переменную три раза
print(a_repeat)
print('<br>------------------------------------<br>')

a_plus_256 = tmp + '256' # дописываем к строке 256
print(a_plus_256)
print('<br>------------------------------------<br>')



